// routeGuard.js
// import store from './store'; // Предполагаем, что у нас есть Vuex-хранилище для хранения информации об авторизации
import store from "../store"

export default function checkRouteGuard(to, from, next) {
  // Получаем информацию об авторизации пользователя из Vuex-хранилища
  const isAuth = store.getters.isAuthenticated

  // Проверяем, какое правило доступа установлено для маршрута
  switch (to.meta.guard) {
    case 'guest':
      // Если маршрут доступен только для гостей, то пропускаем только не авторизованных пользователей
      if (!isAuth) {
        next();
      } else {
        next({ name: 'Test' }); // Перенаправляем авторизованного пользователя на главную страницу
      }
      break;
    case 'auth':
      // Если маршрут доступен только для авторизованных пользователей, то пропускаем только авторизованных пользователей
      if (isAuth) {
        next();
      } else {
        next({ name: 'Login' }); // Перенаправляем не авторизованного пользователя на страницу авторизации
      }
      break;
    case 'all':
      // Если маршрут доступен для всех, то пропускаем всех пользователей
      next();
      break;
    default:
      // Если для маршрута не установлено правило доступа, то пропускаем всех пользователей
      next();
  }
}
